tutorials/compressible/rhoCentralFoam/biconic25-55Run35/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
32385
(
(989.423319803825 460.556508967208 5.097439181284e-11)
(655.62852472424 305.540203113992 -1.17444115450163e-10)
(489.876919264063 228.345948166816 -7.65652888783836e-12)
(399.008664626064 186.000821641354 -3.97980839097545e-11)
(341.161033390033 159.040315951321 -3.65537755306448e-11)
(301.326819913535 140.473733409462 -1.2950048623352e-11)
(271.680067985513 126.65435016605 7.48184754398317e-12)
(248.514899372921 115.856220171987 6.19995821764392e-12)
...
)
;

boundaryField
{
    cone
    {
        type            maxwellSlipU;
        accommodationCoeff 0.85;
        Uwall           uniform (0 0 0);
        thermalCreep    on;
        curvature       on;
        refValue        
255
(
(3.37115877925426 1.5719971556227 1.63068197702874e-10)
(2.71360712438711 1.2653757833256 -2.11600895726952e-10)
(1.53255631280085 0.714642745212946 1.81216394422463e-11)
(0.933662176277062 0.435373822927637 -5.27437735446793e-11)
(0.616983655972557 0.287704203736428 -4.24293353408479e-11)
(0.437874419244962 0.204184195004086 -8.0634513988405e-12)
(0.330914604185556 0.154308014127092 1.0478097563831e-11)
(0.261453433055513 0.121917738084721 4.28302391907071e-12)
(0.213602640042325 0.0996045468538463 4.10347945344935e-12)
(0.178994254718968 0.0834663917412074 -2.87272713194342e-12)
(0.15275446805921 0.0712305782733858 -4.73791083417292e-13)
(0.13235478661851 0.0617180505936849 -1.71600835505468e-12)
(0.115646734477666 0.0539269579275464 -4.47933330670903e-14)
(0.101932795400515 0.0475320431124345 2.43136322656403e-12)
(0.090661114990542 0.0422759722169383 1.06304754417101e-12)
(0.0810476260323619 0.0377931286941698 -8.8272466685353e-13)
(0.072854729191006 0.03397271815456 2.32496460289298e-13)
(0.0658405910497857 0.0307019718239818 -3.12930256165766e-13)
(0.059819939220271 0.0278944957687975 -6.46753678976789e-13)
(0.0546490058405369 0.02548324993399 -2.92199259755226e-13)
(0.0500110729049196 0.0233205462881118 -1.21634038547281e-12)
(0.0459639739888049 0.0214333530702238 4.49849375470468e-13)
(0.0424698201678741 0.0198040023847488 -5.82462187415917e-13)
(0.039261957956162 0.0183081516691188 -1.29606550884641e-14)
(0.0364937632920126 0.0170173212979454 -3.22531737736626e-13)
(0.0341984390626581 0.0159469940318672 2.26883688874806e-13)
(0.0321035284442756 0.0149701211673448 -4.89776044951817e-13)
(0.0300235804179368 0.0140002254741155 -2.98165042630118e-13)
(0.0280899820697995 0.0130985737566165 -5.49838693339268e-13)
(0.0265030149220098 0.0123585588222943 -1.8189306164307e-13)
(0.0251938191024611 0.0117480707856665 -2.82323694667389e-13)
(0.0239360320473169 0.0111615550495043 2.43432298648185e-13)
(0.022707940471733 0.0105888865429009 4.89184017969431e-13)
(0.0216283926721398 0.0100854851365809 2.74320203708041e-13)
(0.0206674577209842 0.00963739380990078 2.06204235711748e-13)
(0.0197528571943988 0.00921090858018066 -5.38997440412039e-14)
(0.0188904730446818 0.0088087722469053 -1.4651915417004e-13)
(0.0180790606227217 0.00843040442063766 -2.55531036152465e-13)
(0.017320380335495 0.00807662599256919 5.06491042198525e-13)
(0.0165860640580335 0.00773420868893428 -2.12767038995427e-13)
(0.0158455556645363 0.00738890395408461 -2.43057965457193e-13)
(0.015137801422058 0.00705887273072222 -1.70502900802516e-13)
(0.0144720900843997 0.00674844643587388 8.5090242127346e-14)
(0.0138128730356782 0.00644104847764474 -1.69006275555339e-14)
(0.0131889500308096 0.00615010840238956 -2.60462149705343e-13)
(0.0126084628978869 0.00587942280684388 -1.35203250579953e-13)
(0.0121038119838818 0.0056441002209554 6.95878012162242e-14)
(0.0117037988494981 0.00545757103303214 -1.693880697423e-14)
(0.0113612563257624 0.0052978408309586 -9.79561347203984e-14)
(0.0110056237249286 0.00513200662572107 6.97290090033197e-14)
(0.0105707242764174 0.00492920968233253 3.34030934423478e-14)
(0.0101358482692379 0.00472642366983935 -1.44743579256085e-13)
(0.00989039686884137 0.00461196780212564 1.33632505179404e-13)
(0.00990035669753271 0.00461661214653411 -2.00718100194525e-14)
(0.00986891565159118 0.00460195094602338 -4.86618226273401e-15)
(0.00953666906616982 0.00444702181884454 9.16378814337464e-14)
(0.00906834593835533 0.00422863915785632 -7.95305512004936e-14)
(0.00868166834314717 0.00404832843397367 -1.22406132279371e-13)
(0.00845031919372019 0.00394044855388517 9.83532588141165e-14)
(0.00840213984425784 0.00391798215426058 1.47777084844634e-13)
(0.0085216100893035 0.0039736920444693 1.75695104063087e-13)
(0.00862402040247107 0.00402144675775217 -1.42333767718301e-13)
(0.00831139050277799 0.0038756650413578 -1.61160620258651e-13)
(0.0073599495370877 0.00343200083278062 -4.29301210111194e-14)
(0.00609461062728733 0.00284196360898364 1.04562237257917e-13)
(0.00526370167427103 0.00245450440095694 -1.75017241775153e-14)
(0.00540631680007784 0.00252100692629452 -9.11270964238889e-14)
(0.00610207020208683 0.00284544206583084 7.13953382033096e-14)
(0.00638661935164914 0.00297812951339253 -9.07602762137432e-14)
(0.00585414433840148 0.00272983233694601 4.24154295879698e-14)
(0.004971678497768 0.00231833175739603 -9.39509236935959e-15)
(0.00472933950001231 0.00220532722687301 3.58854537108852e-14)
(0.00560046272281807 0.0026115386568618 -3.00107572301438e-14)
(0.00688963552734323 0.00321268980828684 4.22604726692472e-15)
(0.00746770188615396 0.00348224657833346 -2.56874989588831e-14)
(0.00680709711170848 0.00317420151299322 -3.70949206796493e-14)
(0.00584912094689939 0.0027274898910134 3.86866542700077e-14)
(0.00971575534946116 0.00453053112421347 -2.2511510955402e-14)
(0.0454788556673629 0.0212071386818153 2.03090220930439e-15)
(0.124288593316536 0.0579567228847935 -7.13204314721596e-14)
(0.142043507262865 0.0662359752278075 3.04033029363306e-14)
(0.0918588395501426 0.0428344803514945 2.14870871206355e-14)
(0.0489554271545849 0.0228282905904041 1.3911578525501e-14)
(0.0265052545094559 0.0123596031591167 -1.92624652153255e-14)
(0.0154009996889322 0.00718160409818322 9.91999012589499e-15)
(0.00845055929172973 0.00394056051343491 -4.47797527433277e-15)
(0.00397818881339127 0.0018550599092704 8.22896071072587e-15)
(0.00213945747891308 0.000997645406713547 -8.2135215081104e-15)
(0.00141270849786519 0.000658756791296152 -4.27004403012223e-15)
(0.000657441748321868 0.000306570122033148 1.22961706772438e-16)
(0.000125334242341306 5.84443170325615e-05 3.65185184153929e-15)
(-1.98071323032695e-05 -9.23621747921675e-06 -1.10210842708501e-14)
(-6.1784068062079e-05 -2.88103840894338e-05 -4.24636777016698e-16)
(-0.000143081801722916 -6.67201398861264e-05 -4.80704331862668e-15)
(-0.000229475422941038 -0.000107006147076003 4.20423080214372e-15)
(-0.000225819321486497 -0.0001053012789686 8.48306037836791e-15)
(-0.000120299850951633 -5.60967417734376e-05 1.41250905459636e-14)
(-9.24155414404961e-05 -4.30940747061566e-05 -1.52483528971056e-15)
(-0.000215475756758858 -0.000100477995523265 -5.8914944576501e-15)
(-0.000318481898737346 -0.000148510548364523 -2.42616273783502e-16)
(-0.000256774994822292 -0.000119736146508049 -3.99811800578312e-16)
(-0.00023327164439247 -0.000108776354210871 1.01171082571068e-14)
(-0.000470671653457042 -0.000219477796483089 6.1944137316558e-15)
(-0.00084127874191347 -0.000392294719997046 6.21826119329209e-15)
(-0.00102235991798451 -0.000476734259147354 8.63630703996976e-15)
(-0.00082550515941916 -0.000384939377683563 -2.30929948686198e-15)
(-0.000458721023921524 -0.000213905126411281 -7.2949493321489e-16)
(-0.000325081099718119 -0.000151587806320112 -1.54601587118903e-15)
(-0.000450021339333157 -0.000209848396864118 -4.85455641409108e-15)
(-0.000474623532973014 -0.000221320588165926 -1.3296639214873e-15)
(-0.000151880514752744 -7.08230471530797e-05 -5.82870080488568e-16)
(0.000330177902048638 0.000153964484278747 -8.89197430761307e-15)
(0.00110381398799701 0.000514716915781421 -2.9725172313203e-15)
(0.00217790487982005 0.00101557372419427 -5.03146301912665e-15)
(0.00344174671600189 0.00160491285110264 3.9077262619642e-15)
(0.00464752318954225 0.0021671756547335 -2.62246688500777e-15)
(0.00572824253967266 0.00267112336402133 -4.90402368144901e-15)
(0.00753794740741378 0.00351500260284082 8.89713206875745e-16)
(-0.000161243737220915 -0.000230279921911521 1.41141841394352e-15)
(2.65222457126955e-05 3.78776923493866e-05 2.17661500049813e-15)
(0.000355243654151606 0.000507340516585357 -3.92954637803029e-15)
(-1.00693582174316e-05 -1.43805338674261e-05 -1.53851718863513e-15)
(-0.000613854758590841 -0.000876675449910478 1.68516456658099e-15)
(-0.00175298846396578 -0.00250352698064919 -6.78740536193069e-15)
(-0.00397288430742728 -0.00567386680467249 -4.49576359631225e-16)
(-0.00693517985156598 -0.00990446328141441 -2.79206054717067e-15)
(-0.00977391825730894 -0.0139586018772337 -8.32537875075879e-16)
(-0.0115682315102473 -0.0165211467729216 -1.3758223255363e-15)
(-0.0110959964399246 -0.0158467251984783 -3.90147184162072e-15)
(-0.0090243192563075 -0.0128880635580965 3.35320302347754e-15)
(-0.00714795673398128 -0.0102083401619239 -2.08948005862104e-15)
(-0.00593893141319062 -0.00848167305993104 -1.03601715087432e-14)
(-0.00549467422013891 -0.00784720803513625 -4.3830981770166e-15)
(-0.00572490815571132 -0.00817601617144437 -3.42867563453689e-15)
(-0.00581102744934813 -0.00829900726884726 1.46423509228165e-14)
(-0.00553480349813475 -0.00790451858365556 -1.81013120621102e-15)
(-0.00498863540873312 -0.00712450971523338 -3.41228285490452e-14)
(-0.00465159359111706 -0.00664316411535045 -4.903624650269e-15)
(-0.00401322983435958 -0.00573148618857504 4.26199005701798e-15)
(-0.00276088099007426 -0.00394294668285174 -8.32023514670511e-14)
(-0.00146257437986654 -0.00208877268530493 -1.47493386771448e-13)
(0.000908495095461102 0.00129746545970388 -1.55611035309706e-13)
(0.00291657217688682 0.0041652967409871 -1.16834086570537e-13)
(0.00432228145298359 0.00617285764163907 -7.17323439805404e-14)
(0.00554058730786402 0.00791277871995086 -2.82513698714471e-14)
(0.00542890738860967 0.00775328326576151 2.00685555147423e-13)
(0.00255950369037039 0.00365535009366399 3.61736692127716e-14)
(-0.00319433139146231 -0.00456197800960413 4.27563958466536e-15)
(-0.00925627326777547 -0.0132193282172886 4.10615094034806e-15)
(-0.0155359287086395 -0.0221876056181829 6.90785821354446e-16)
(-0.0146126532305026 -0.0208690315843279 6.81351695829636e-16)
(-0.00681921263976955 -0.0097388449389865 -5.86950402838603e-15)
(-0.00223247971085669 -0.00318831144915352 -2.89453751013763e-14)
(0.000806603838362779 0.00115194966399296 -2.60823071763462e-14)
(0.00480752781978715 0.00686586127316423 -8.24105592550739e-15)
(0.00797150922982696 0.0113844950172374 -5.02065321716092e-15)
(0.00957039570564005 0.0136679415509078 3.01614910886194e-16)
(0.00907949180613208 0.0129668581250855 7.38522357954273e-15)
(0.00685470571660369 0.00978953430602113 5.50883126416406e-15)
(0.00772848790931857 0.0110374246028269 3.0040993166744e-15)
(0.0101150403551942 0.0144457747213182 1.22011602357446e-17)
(0.00696774336724391 0.0099509688013351 1.07363075607735e-15)
(0.00362511978586205 0.00517720759636756 6.9437623393714e-15)
(0.00174291608536659 0.00248914213326619 3.01040367082808e-15)
(-6.11554189030754e-05 -8.73389896067602e-05 -4.08113307938702e-16)
(-0.00020486671932494 -0.00029257999686027 -5.09678066504025e-15)
(0.00026521661896089 0.000378768585724543 -3.00814944565422e-15)
(0.000505168614848006 0.000721455550365145 2.46411656240633e-15)
(0.000723202396831304 0.00103284006150913 -1.69370070662126e-16)
(0.00129333140616633 0.00184706866977111 1.43393527853156e-15)
(0.00221974180635114 0.0031701198362322 -3.74795151464533e-15)
(0.00234591407346285 0.00335031250801057 -1.33285640237368e-16)
(0.00177788374000372 0.00253908111948243 -8.15960038871914e-16)
(0.00165604521584578 0.0023650776741071 -3.10374018859299e-15)
(0.00188877357068448 0.00269744821015855 -2.26445095267876e-15)
(0.00232175013686209 0.00331580283010957 -3.34081679333687e-15)
(0.00251782054716383 0.00359582039575339 1.83876872692484e-15)
(0.0018610183590986 0.00265780966005308 -5.37337440600253e-16)
(0.000452291102706928 0.000645938636803003 1.55122012746162e-15)
(-0.00113046639198899 -0.00161447332440557 -7.73106263186714e-16)
(-0.00233299865127371 -0.00333186737351841 3.73722052180518e-16)
(-0.002483962694925 -0.00354746637160273 1.69406755321287e-15)
(-0.00106963650586924 -0.00152759924380409 1.53899129594195e-15)
(0.000739355385370407 0.00105590891987441 2.25287837008987e-15)
(0.00212060414100099 0.00302853657706637 6.89495944520411e-16)
(0.00275428421982162 0.00393352551852943 1.69895820374404e-15)
(0.00187417533025451 0.00267659976221395 -3.68158146874624e-15)
(0.000114522555112113 0.000163555158806376 -1.98216281438844e-15)
(-0.00138786819365651 -0.00198208119441007 -1.69598102581694e-15)
(-0.00179303061913883 -0.0025607131047432 3.1838639046875e-15)
(-0.00124615052827307 -0.00177968739303435 -1.78145664367531e-15)
(-0.000804565650950591 -0.00114903883071515 -2.62561650744591e-16)
(-0.000584865870993382 -0.000835275027878415 -8.66517522394771e-16)
(-0.000269015422151263 -0.000384193838924976 2.61949245735341e-16)
(-7.08634392315751e-05 -0.000101203479491487 -1.02447467625818e-15)
(-1.72795868361017e-05 -2.46778074980617e-05 -1.06620125731728e-15)
(7.05105596600377e-05 0.000100699515231508 9.44287683625671e-16)
(0.000308089697311846 0.000439997687110989 -3.33373383363476e-15)
(0.000638961971070544 0.000912532265379092 -1.88885346720576e-15)
(0.000938017848501731 0.00133962832060716 1.18344764639389e-15)
(0.00103654837274039 0.00148034449243836 1.65653652802382e-15)
(0.00102661391291774 0.00146615661340901 3.56297047487389e-16)
(0.00106455898929001 0.0015203477986292 2.48324639179802e-15)
(0.00100690537219582 0.00143800990028854 -3.58758225773148e-15)
(0.00110412950734483 0.00157686035510394 -5.95835828392023e-16)
(0.00139237710792515 0.00198852059130655 -1.30632091380191e-15)
(0.00142147502625387 0.00203007672535261 -1.14191787379007e-15)
(0.00115527930335042 0.00164990983433312 -3.47477890473319e-15)
(0.00091960479725314 0.0013133317581954 -9.38852824513139e-16)
(0.000959296305447604 0.00137001710648857 -1.7921556822459e-15)
(0.00103985698059159 0.0014850696741263 3.08802172098364e-15)
(0.000927076102910652 0.00132400188846508 3.96520326882168e-16)
(0.000785544963741534 0.00112187447417845 2.48359457730332e-15)
(0.000730319738283581 0.00104300467851194 -1.23579306411959e-15)
(0.000705435315576534 0.00100746603982449 -1.3264398427372e-15)
(0.000581626322765077 0.000830648473519395 1.77312507391936e-15)
(0.000295329533113168 0.000421774284051915 4.40023585748822e-16)
(-9.60613202515968e-06 -1.37189783053912e-05 -7.28423855799046e-16)
(-0.000249264052555399 -0.0003559859598134 -1.98767353259489e-15)
(-0.000432598642444338 -0.000617814888923827 1.71683134332112e-15)
(-0.000549431616812798 -0.000784669668391113 -1.23519567513508e-15)
(-0.000601991612033054 -0.00085973312080415 1.35067475580497e-15)
(-0.000644231472295817 -0.000920057893034124 1.54633078160077e-16)
(-0.000660644104746868 -0.00094349756135836 -4.37493424382234e-16)
(-0.000894082507987636 -0.00127688215166241 5.5442864997195e-16)
(-0.00234328714794362 -0.0033465608695455 2.23234930761607e-18)
(-0.0103316633761006 -0.0147551444568298 7.98985548613467e-16)
(-0.0691753615787067 -0.0987926547535652 -1.63274429439313e-15)
(-0.325179931415733 0 1.10951926568593e-15)
(-0.338250966178972 0 3.18224588168089e-16)
(-0.189833903010359 0 2.81435655559637e-15)
(0.147657428457537 0 -3.00082225137031e-16)
(0.0846959439156498 0 4.50496508219161e-16)
(-0.13347363983481 0 4.0719118583437e-15)
(-0.0327512539477142 0 4.0758557627955e-16)
(0.0633774097049022 0 -1.60859754239163e-15)
(-0.00133157140981451 0 -1.97837552370756e-15)
(-0.0504072470322146 0 -1.81155454800949e-15)
(-0.0214394634115842 0 5.67635741357397e-15)
(0.0100497553833692 0 -8.44862084527796e-16)
(0.0199309901860381 0 2.35990592735784e-15)
(0.0242543797745455 0 1.1211266784359e-15)
(0.0248108797633271 0 1.59151353624952e-15)
(0.0154376997789094 0 2.17367662874079e-15)
(0.0033646255231103 0 -2.65596654502587e-17)
(-0.00410677815330078 0 7.41728463075507e-15)
(-0.00912405774256449 0 2.12215080083545e-15)
(-0.0133034278952202 0 -4.15260065167245e-15)
(-0.0101647263219772 0 -3.55944806975843e-15)
(0.00603021999198822 0 -1.3642669376979e-15)
(0.0363043107794913 0 6.36095745615219e-16)
(0.0895086443317091 0 1.62427161956421e-15)
(0.153960092558853 0 -2.49489793244146e-15)
(0.194881723885061 0 1.05496284828244e-15)
(0.103666873607679 0 -6.64100738660639e-16)
)
;
        valueFraction   
255
(
0.00388739013936794
0.00624177317187908
0.00849035155805145
0.0107554856963952
0.013027374054784
0.0152855267181262
0.017572003248215
0.0198852696559785
0.0222267151632822
0.0246055102903818
0.0270175214123674
0.0294517774807028
0.0319168888932602
0.0343955979549568
0.0368796738123101
0.0393788445077676
0.0418888091082135
0.0444028451846672
0.046919047857676
0.0494405286601239
0.0519672687305106
0.0545062739712272
0.057039980348075
0.0595839223092821
0.0621335738382848
0.0646819276416041
0.0672303769493935
0.0697933982770882
0.0723750559356825
0.0749647273117693
0.0775503898939673
0.0801369381430717
0.0827251695089773
0.085310482339595
0.087884689048565
0.0904518191988526
0.093008027228878
0.0955588383518458
0.0981033071846665
0.100647777619199
0.103196111964922
0.10575279619807
0.10831193976211
0.11087636335783
0.113439592853068
0.116000656727753
0.118560628276778
0.121113715885514
0.123662642507282
0.126213140633326
0.128774280267977
0.131346440137882
0.133915413347571
0.136463767956537
0.138987965929785
0.141525725645499
0.144088937486324
0.146670645568613
0.1492590571607
0.151851752482629
0.154443855713579
0.157044853577594
0.1596790053475
0.162382249836762
0.165137332069016
0.167882676359352
0.170526416834943
0.173060661896198
0.175576642350055
0.178170929472405
0.180844224519606
0.183499333898441
0.186010819966416
0.188404158424284
0.190814331569009
0.193407084976195
0.196295760039457
0.199683967753034
0.204997112222206
0.223526278941726
0.275094348287103
0.340209980763413
0.38856779682837
0.418769229699641
0.437061435796801
0.449746501055671
0.460180202717312
0.468105631662148
0.473939149896247
0.479446664023703
0.485189296564931
0.490551308212875
0.495364294474439
0.499980045527216
0.50450382029689
0.508855710220258
0.512843226491191
0.516579958734632
0.520395970950094
0.524317310990268
0.528198532933312
0.532163243630724
0.536678047328048
0.54178521692749
0.547030518881593
0.551885926534209
0.556405953511508
0.561214943104997
0.566822400678246
0.573265011844167
0.580560524644532
0.588832612537391
0.598089742839339
0.608497220041338
0.620998729914999
0.637365238042678
0.662195467374275
0.723773270016847
0.707717090006228
0.656143547185924
0.633780499865311
0.619477316583062
0.6087938544528
0.599652087104729
0.590461786986191
0.579983997758578
0.567022673035227
0.551867002207499
0.53942048351193
0.532105242106878
0.532719382904369
0.538254814581199
0.546536173929477
0.556829253246783
0.569318035379159
0.582426488399807
0.596683395449696
0.610453206783969
0.625816311616276
0.639807364011139
0.65414656840104
0.671081798275382
0.685222134419233
0.701501893820894
0.718211838478761
0.736846666172514
0.746458974685605
0.755917930066686
0.761174413674681
0.754326995166793
0.744435323791478
0.734949943377913
0.720169600415492
0.700147717023133
0.669992336392029
0.633438582905802
0.596565445117858
0.565384594441716
0.541262771612974
0.517306177306826
0.493817173562213
0.493725573876324
0.50445997096186
0.520281195924135
0.534243926433428
0.53860102441366
0.536991310014421
0.531706940273114
0.522975343262644
0.514225150253952
0.50779309303419
0.504724946631352
0.506370607637709
0.510647312231246
0.517246509636103
0.526478135295984
0.538045538369916
0.551725471949641
0.567056311265468
0.580095115688365
0.588447757755298
0.592708688485092
0.595038572601833
0.596276183301269
0.599039648572896
0.605833352949444
0.615472852493592
0.62683393963045
0.634524099422322
0.637170716402156
0.636986684867999
0.634527984128234
0.630212169835413
0.624222546241857
0.617180477931173
0.609969266459187
0.602782518503815
0.595655372822663
0.58885750670071
0.582669260510082
0.577202576549697
0.572640283432124
0.568608448235006
0.565527761830712
0.563568928998257
0.562175509506864
0.561543719553741
0.562132761805108
0.5634770509826
0.564766856878982
0.566179890295133
0.5683411950384
0.571289099079791
0.574528055674193
0.57779424167982
0.58074362731146
0.5836452680233
0.585866596359053
0.58699081214521
0.58685673696179
0.585291850406577
0.581918701718381
0.57618354034176
0.567650544478462
0.554230069500262
0.534019374645577
0.495451183533854
0.406763495305645
0.0969347586520038
0.0808247041149165
0.0839042493927553
0.0707946503205458
0.0657346447339447
0.0666892285712637
0.063601564456299
0.0591848957525686
0.0573799270921354
0.0561660030368895
0.0543605862361932
0.0524499415324764
0.0507586947017633
0.0492370654237796
0.0479423627090572
0.0469712802193946
0.046282778248733
0.0457766444630362
0.0454030405768994
0.0451375713013182
0.0449383419911948
0.044857966196937
0.0452563310103987
0.0461538883813907
0.0488535240486822
0.0540273753407627
0.0574277259987618
)
;
        value           nonuniform List<vector> 
255
(
(985.277612722112 459.442496220996 5.14101441685411e-11)
(651.482989892647 303.79150734464 -1.18032333902641e-10)
(485.697507906774 226.484467483758 -7.4375853078643e-12)
(394.704450194364 184.053707833492 -3.99373875211189e-11)
(336.7073676614 157.009224097703 -3.66303791862258e-11)
(296.713516742241 138.359785134999 -1.28753856576311e-11)
(266.899823467159 124.457431642979 7.53453345896321e-12)
(243.567733509709 113.577499415038 6.16186825136953e-12)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            fixedValue;
        value           uniform (2713 0 0);
    }
    centreLeft
    {
        type            symmetryPlane;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}

// ************************************************************************* //
